[
  {
    "id": 5,
    "titre": "Projet Réseau: Implémentation d'un Routage Statique",
    "type": "routage",
    "image": "img/routage.webp",
    "videoUrl": "videos/test_ping.mp4",
    "paragraphe": "Suite à une surcharge générale, tous les routeurs du réseau ont perdu leurs configurations. La tâche consistait à redémarrer et reconfigurer les interfaces réseau et les tables de routage de chaque routeur. Réinitialisation et reconfiguration des interfaces des routeurs dans les villes, mise en place d'un routage statique et Tests de connectivité ",
    "site": "https://marcusdeveloppement.github.io/Routage/",
    "description": "Réinitialisation et reconfiguration des interfaces des routeurs dans les villes, mise en place d'un routage statique et Tests de connectivité "
  },
  {
    "id": 6,
    "titre": "Projet Windows server: L'active directory avec l'AGDLP",
    "type": "agdlp",
    "image": "img/instalAD.webp",
    "image2": "img/creaDL.webp",
    "image3": "img/newDisk.webp",
    "paragraphe": "projet de mise en place d'une gestion des droits d'accès structurée avec l'AGLPD (Accounts, Global groups, Domain local groups, Permissions) pour les quatre principaux départements de l'entreprise : Comptabilité, Direction, Marketing et Tech. Avec la création de Groupes Globaux et de Domaine Locaux, l'association des groupes et l'attributions des permissions.",
    "site": "https://marcusdeveloppement.github.io/AGDLP_AD/",
    "description": "Mise en place de l'AGLPD pour renforcer la sécurité et simplifier la gestion des droits d'accès dans les systèmes informatiques."
  },
  {
    "id": 7,
    "titre": "Projet Linux : Infrastructure de fichiers sécurisée avec Samba, LDAP et sauvegarde",
    "type": "linux",
    "image": "img/waiting.webp",
    "paragraphe": "Ce projet simule une infrastructure de fichiers d’entreprise composée de 4 machines virtuelles sous Linux et Windows. Il met en œuvre des services essentiels pour une gestion efficace, centralisée et sécurisée des utilisateurs et des fichiers : annuaire LDAP, serveur Samba, quotas disques, sauvegardes automatiques, et test d’accès depuis un client Windows.",
    "site": "https://marcusdeveloppement.github.io/Linux-files-server/",
    "description": "annuaire LDAP, serveur Samba, quotas disques, sauvegardes automatiques, et test d’accès depuis un client Windows."
  },
  {
    "id": 8,
    "titre": "Projet Powershell: Importation d'utilisateurs via csv dans l'Active directory",
    "type": "powershell",
    "image": "img/csvSheet.webp",
    "image2": "img/CréationOU.webp",
    "image3": "img/ajout-des-utilisateurs.webp",
    "paragraphe": "L’objectif de ce projet est d’automatiser l’importation d’utilisateurs dans un environnement Active Directory à partir d’un fichier CSV. Grâce à un script PowerShell personnalisé, les comptes sont créés dynamiquement avec génération d’identifiants, affectation dans les bonnes unités d'organisation (OU), vérification des doublons, et génération d’un journal d’importation. Ce processus permet de faciliter et sécuriser la gestion des utilisateurs à grande échelle.",
    "site": "https://marcusdeveloppement.github.io/Powershell-CSV/",
    "github": "https://github.com/MarcusDeveloppement/Powershell-CSV",
    "description": "Le script gère la création des comptes depuis un fichier CSV, les affecte aux bonnes OU, évite les doublons et génère un rapport d’import."
  }
]
