[
  {
    "id": 5,
    "titre": "Projet Réseau: Implémentation d'un Routage Statique",
    "type": "routage",
    "image": "img/routage.webp",
    "videoUrl": "videos/test_ping.mp4",
    "paragraphe": "Suite à une surcharge générale, tous les routeurs du réseau ont perdu leurs configurations. La tâche consistait à redémarrer et reconfigurer les interfaces réseau et les tables de routage de chaque routeur. Réinitialisation et reconfiguration des interfaces des routeurs dans les villes, mise en place d'un routage statique et Tests de connectivité ",
    "github": "https://github.com/MarcusDeveloppement/CloudServerSetup",
    "description": "Réinitialisation et reconfiguration des interfaces des routeurs dans les villes, mise en place d'un routage statique et Tests de connectivité "
  },
  {
    "id": 6,
    "titre": "Projet Windows server: L'active directory avec l'AGDLP",
    "type": "agdlp",
    "image": "img/Linux.webp",
    "image2": "img/networkDesign.webp",
    "paragraphe": "porojet de mise en place d'une gestion des droits d'accès structurée avec l'AGLPD (Accounts, Global groups, Domain local groups, Permissions) pour les quatre principaux départements de l'entreprise : Comptabilité, Direction, Achat et Tech. Avec la création de Groupes Globaux et de Domaine Locaux, l'association des groupes et l'attributions des permissions",
    "github": "https://github.com/MarcusDeveloppement/WANOptimization",
    "description": "Mise en place de l'AGLPD pour renforcer la sécurité et simplifier la gestion des droits d'accès dans les systèmes informatiques."
  },
  {
    "id": 7,
    "titre": "Projet Linux: Script d'automatisation de sauvegarde",
    "type": "linux",
    "image": "img/réseau.webp",
    "image2": "img/securityMonitoring.webp",
    "paragraphe": "Automatisation de sauvegarde via un script écrit en python qui permet d'eviter la pertes de données en cas de coupure de courant ou problème logiciel",
    "github": "https://github.com/MarcusDeveloppement/NextGenFirewall",
    "description": "Déploiement d'une solution de sécurité complète pour protéger les infrastructures critiques contre les menaces modernes."
  },
  {
    "id": 8,
    "titre": "Projet réseau: Renforcement de la Sécurité Réseau avec un Firewall",
    "type": "firewall",
    "image": "img/packet.webp",
    "image2": "img/securityMonitoring.webp",
    "paragraphe": "Implémentation d'un firewall de nouvelle génération avec des capacités de prévention des intrusions, gestion des applications et filtrage de contenu pour sécuriser le réseau d'entreprise.",
    "github": "https://github.com/MarcusDeveloppement/NextGenFirewall",
    "description": "Déploiement d'une solution de sécurité complète pour protéger les infrastructures critiques contre les menaces modernes."
  }
]
